ХМНПФ_Общее/InformationRegisters/уп_СостоянияДоговораОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияДоговораОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияДоговоровОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПенсионныеПравила.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПенсионныеПравила</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Правопреемники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьПроводкиСводно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПредоставлятьСоциальныйВычет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВсегдаНачислятьЗаПолныйПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РассчитыватьОУДПриЗачислении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьПроводкиСводноОПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВестиРезервВыплатОПСПоДоговорам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВестиРезервВыплатОПСПоТипамСумм</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписыватьТипыСуммПропорционально</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДФЛПравопреемниковОПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтрольНомеровДоговоровОПСГод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Корректировать51СчетПоВидамДеятельности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСклонятьФИОВДокументах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасчетИДОПСпоПриказуФСФР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСписыватьИДРасторженцевОПСПриНачислении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетНачисленияИДПриЗакрытии</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОпределениеКоличестваВыплат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПечататьФИОВЗаявлениях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвращатьСредстваУмершихДоВступленияВДействие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МетодРасчетаРазмещенногоПРДляДекларации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтрольНумерацииДоговоров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостояниеЧастиПенсионногоСчетаОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_РасшифровкаСостоянияДоговораОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостояниеЧастиПенсионногоСчетаОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_РасшифровкаСостоянияДоговораОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_РезервыОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РезервыОПС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВосполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Движение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДвиженияЕПС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.епс_ВидыДвиженияПенсионныхНакоплений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_ПоступленияОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПоступленияОПС</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВосполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаКонцаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дополнительно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДополнительныеСведенияОВзносах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КатегорияСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_КатегорияВзносаОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/CommonModules/уп_НачислениеИД/Ext/Module.bsl
// ХМНПФ 19.02.2018 ШадринАВ // Новая ХМ_ПолучитьЗапросСОтбором() // №1358
Функция ХМ_ПолучитьЗапросСОтбором(ХМ_ТекОбъект)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уп_ДоговорыОПС.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(, ) КАК СостоянияДоговораОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уп_ДоговорыОПС КАК уп_ДоговорыОПС
	|		ПО СостоянияДоговораОПС.ДоговорОПС = уп_ДоговорыОПС.Ссылка
	|ГДЕ
	|	уп_ДоговорыОПС.Организация = &Организация
	|	И СостоянияДоговораОПС.Состояние В(&СписокСостояний)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Организация", ХМ_ТекОбъект.Организация);
	Запрос.УстановитьПараметр("ДатаКон", ХМ_ТекОбъект.КонецПериода);
	Если ЗначениеЗаполнено(ХМ_ТекОбъект.ХМ_ДоговорОПС) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "уп_ДоговорыОПС.Организация = &Организация", "уп_ДоговорыОПС.Организация = &Организация И уп_ДоговорыОПС.Ссылка = &ХМ_ДоговорОПС");
		Запрос.УстановитьПараметр("ХМ_ДоговорОПС", ХМ_ТекОбъект.ХМ_ДоговорОПС);
	КонецЕсли;
	СписокСостояний = Новый СписокЗначений;
	Если ХМ_ТекОбъект.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатнойПериод);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатыПриостановлены);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ЕдиновременнаяВыплата);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.Закрыт);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.НакопительныйПериод);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.НачисленияПриостановлены);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ОбязательстваВыполнены);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию);
	ИначеЕсли ХМ_ТекОбъект.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты Тогда
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатнойПериод);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.Закрыт);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.НачисленияПриостановлены);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатыПриостановлены);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ОбязательстваВыполнены);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию);
	ИначеЕсли ХМ_ТекОбъект.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.Выплатной Тогда
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатнойПериод);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.Закрыт);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.НачисленияПриостановлены);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатыПриостановлены);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ОбязательстваВыполнены);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию);
	КонецЕсли;	
	Запрос.УстановитьПараметр("СписокСостояний", СписокСостояний);
	
	Возврат Запрос;
КонецФункции

// ХМНПФ 19.02.2018 ШадринАВ // Новая ХМ_ПолучитьТабИзбранных() // №1358
Функция ХМ_ПолучитьТабИзбранных(ТекОбъект,ИмяОбласти,ИмяМакета)
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ДоговорОПС", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(13,ДопустимаяДлина.Переменная)));
	
	Если Год(ТекОбъект.КонецПериода) = 2018 И ТекОбъект.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда // ХМНПФ 01.02.2019 ШадринАВ // №2012
		Макет = Обработки.уп_НачислениеИДОПС.ПолучитьМакет(ИмяМакета);
		ОблВст = Макет.ПолучитьОбласть(ИмяОбласти);
	    ВысотаТаб = ОблВст.ВысотаТаблицы;
		Для НСтр = 1 По ВысотаТаб Цикл
			НовСтр = ТЗ.Добавить();
			НовСтр.ДоговорОПС = СокрЛП(ОблВст.Область(НСтр, 1).Текст);
		КонецЦикла;
	КонецЕсли;
	ТЗ.Свернуть("ДоговорОПС");
	
	Возврат ТЗ
КонецФункции // ХМ_ПолучитьТабИзбранных()

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 15.02.2018 ШадринАВ // ВыполнитьНачислениеДляРПН() // №1358
	// ХМНПФ 15.02.2018 ШадринАВ // СледующаяПачкаДоговоров() // №1358
	// ХМНПФ 15.02.2018 ШадринАВ // ЗапросБазыНачислений() // №1358
	// ХМНПФ 19.02.2018 ШадринАВ // Новая ХМ_ПолучитьЗапросСОтбором() // №1358
	// ХМНПФ 19.02.2018 ШадринАВ // Новая ХМ_ПолучитьТабИзбранных() // №1358
	// ХМНПФ 04.02.2019 ШадринАВ // ЗапросБазыНачислений() // №2012
	// ХМНПФ 22.07.2021 ШадринАВ // ЗапросБазыНачислений() // №3274
	// ХМНПФ 26.07.2021 ШадринАВ // ЗапросБазыНачислений() // №3268 
	// ХМНПФ 02.02.2023 МилевскийАЮ // ЗапросБазыНачислений() // №3533
КонецПроцедуры

&ИзменениеИКонтроль("СледующаяПачкаДоговоров")
Функция ХМСледующаяПачкаДоговоров(РазмерПачкиДоговоров, ВыборкаДоговоров, МеньшийДоговор, БольшийДоговор, Организация, ОтборДоговор, ОтборПодразделение, ХМ_ТекОбъект)
	// -ХМНПФ 15.02.2018 ШадринАВ // СледующаяПачкаДоговоров() // №1358

	Если ВыборкаДоговоров = Неопределено Тогда
		УсловияОтбора = "";
		Если ОтборДоговор<>Неопределено Тогда
			УсловияОтбора = УсловияОтбора+" И уп_ДоговорыОПС.Ссылка В ИЕРАРХИИ (&ОтборДоговор)";
		КонецЕсли;
		Если ОтборПодразделение<>Неопределено Тогда
			УсловияОтбора = УсловияОтбора+" И уп_ДоговорыОПС.ПодразделениеБУ = &ОтборПодразделение";
		КонецЕсли;


		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	уп_ДоговорыОПС.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.уп_ДоговорыОПС КАК уп_ДоговорыОПС
		|ГДЕ
		|	уп_ДоговорыОПС.Организация = &Организация "+УсловияОтбора+"
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";

		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ОтборДоговор", ОтборДоговор);
		Запрос.УстановитьПараметр("ОтборПодразделение", ОтборПодразделение);
		#Вставка
		// +ХМНПФ 15.02.2018 ШадринАВ // СледующаяПачкаДоговоров() // №1358
		Запрос = ХМ_ПолучитьЗапросСОтбором(ХМ_ТекОбъект);
		// -ХМНПФ 15.02.2018 ШадринАВ // СледующаяПачкаДоговоров() // №1358
        #КонецВставки

		ВыборкаДоговоров = Запрос.Выполнить().Выбрать();

	КонецЕсли;

	Счетчик = 0;
	МеньшийДоговор = Неопределено;
	БольшийДоговор = Неопределено;

	Если Не ВыборкаДоговоров.Следующий() Тогда
		Возврат Ложь
	КонецЕсли;

	МеньшийДоговор = ВыборкаДоговоров.Ссылка;

	Пока Счетчик < РазмерПачкиДоговоров И ВыборкаДоговоров.Следующий() Цикл
		Счетчик = Счетчик + 1;
	КонецЦикла;

	БольшийДоговор = ВыборкаДоговоров.Ссылка;

	Возврат Истина

КонецФункции

&ИзменениеИКонтроль("ВыполнитьНачислениеДляРПН")
Процедура ХМВыполнитьНачислениеДляРПН(ТекОбъект)

	ПенсионныеПравила = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(ТекОбъект.КонецПериода, Новый Структура("Организация", ТекОбъект.Организация));

	РазмерПачкиДоговоров = 90000;
	#Вставка
	// +ХМНПФ 15.02.2018 ШадринАВ // ВыполнитьНачислениеДляРПН() // №1358
   	РазмерПачкиДоговоров = 500000;
	// -ХМНПФ 15.02.2018 ШадринАВ // ВыполнитьНачислениеДляРПН() // №1358
	#КонецВставки

	ВыборкаДоговоров = Неопределено;
	МеньшийДоговор = Неопределено;
	БольшийДоговор = Неопределено;

	МассивОбходов = Новый Массив;

	#Удаление 
	МассивОбходов.Добавить("ПодразделениеБУ");	
	#КонецУдаления
	#Вставка
	// +ХМНПФ 15.02.2018 ШадринАВ // ВыполнитьНачислениеДляРПН() // №1358
    #КонецВставки

	Если ТекОбъект.ГруппаДоговоров Тогда
		МассивОбходов.Добавить("ГруппаДоговора");
	КонецЕсли;
	// +ХМНПФ 15.02.2018 ШадринАВ // ВыполнитьНачислениеДляРПН() // №1358
	//--Пока СледующаяПачкаДоговоров(РазмерПачкиДоговоров, ВыборкаДоговоров, МеньшийДоговор, БольшийДоговор, ТекОбъект.Организация) Цикл
	Пока СледующаяПачкаДоговоров(РазмерПачкиДоговоров, ВыборкаДоговоров, МеньшийДоговор, БольшийДоговор, ТекОбъект.Организация,,, ТекОбъект) Цикл
		// -ХМНПФ 15.02.2018 ШадринАВ // ВыполнитьНачислениеДляРПН() // №1358

		Запрос = ЗапросБазыНачислений(ТекОбъект, МеньшийДоговор, БольшийДоговор, ПенсионныеПравила);
		//Время1 = ТекущаяУниверсальнаяДатаВМиллисекундах();
		РезультатЗапроса = Запрос.Выполнить();
		//Время2 = ТекущаяУниверсальнаяДатаВМиллисекундах();
		//ВызватьИсключение Строка((Время2 - Время1) / 1000);
		Выборка = РезультатЗапроса.Выбрать();

		ОбойтиВыборку(Выборка, МассивОбходов, 0, ТекОбъект);

	КонецЦикла;

КонецПроцедуры

&ИзменениеИКонтроль("ЗапросБазыНачислений")
Функция ХМЗапросБазыНачислений(ТекОбъект, МеньшийДоговор, БольшийДоговор, ПенсионныеПравила)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МеньшийДоговор", МеньшийДоговор);
	Запрос.УстановитьПараметр("БольшийДоговор", БольшийДоговор);
	Запрос.УстановитьПараметр("Организация", ТекОбъект.Организация);
	#Вставка
	// +ХМНПФ 04.02.2019 ШадринАВ // ЗапросБазыНачислений() // №2012
	ТекОбъект.КонецПериода = КонецДня(ТекОбъект.КонецПериода);
	// -ХМНПФ 04.02.2019 ШадринАВ // ЗапросБазыНачислений() // №2012
	#КонецВставки
	Запрос.УстановитьПараметр("ДатаРасчета", КонецДня(ТекОбъект.КонецПериода));
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ТекОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекОбъект.КонецПериода));
	Запрос.УстановитьПараметр("НачГодаПериодаНачисления", НачалоГода(ТекОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("ПорядокРасчетаИДОбязательстваВыполнены",ПенсионныеПравила.ПорядокРасчетаИДОбязательстваВыполнены);
	Запрос.УстановитьПараметр("НачислятьИДДосрочныйПереход",ПенсионныеПравила.НачислятьИДДосрочныйПереход);
	Запрос.УстановитьПараметр("НачислятьИДПереход",ПенсионныеПравила.НачислятьИДПереход);
	Запрос.УстановитьПараметр("НачислятьИДПоНевступившимСилу",ПенсионныеПравила.НачислятьИДПоНевступившимСилу);
	Запрос.УстановитьПараметр("НачислятьИДПоРешениюСуда",ПенсионныеПравила.НачислятьИДПоРешениюСуда);
	//Запрос.УстановитьПараметр("НеНачислятьИДМСКВозврат",ПенсионныеПравила.НеНачислятьИД_ВозвратМСК);
	СписокСостояний = Новый СписокЗначений;
	Если ТекОбъект.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатнойПериод);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатыПриостановлены);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ЕдиновременнаяВыплата);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.Закрыт);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.НакопительныйПериод);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.НачисленияПриостановлены);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ОбязательстваВыполнены);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию);

		Запрос.УстановитьПараметр("НакопительныйПериод",Перечисления.уп_СостоянияДоговоровОПС.НакопительныйПериод);
	ИначеЕсли ТекОбъект.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты Тогда
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатнойПериод);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.Закрыт);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.НачисленияПриостановлены);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатыПриостановлены);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ОбязательстваВыполнены);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию);

		Запрос.УстановитьПараметр("НакопительныйПериод",Неопределено);
	ИначеЕсли ТекОбъект.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.Выплатной Тогда
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатнойПериод);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.Закрыт);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.НачисленияПриостановлены);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ВыплатыПриостановлены);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ОбязательстваВыполнены);
		СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию);

		Запрос.УстановитьПараметр("НакопительныйПериод",Неопределено);
	КонецЕсли;	
	Запрос.УстановитьПараметр("СписокСостояний", СписокСостояний);

	СписокТиповРезерва = Новый СписокЗначений;
	СписокТиповРезерва.Добавить(ТекОбъект.ТипРезерва);
	Если ТекОбъект.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийЕВ);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийВозвратМСКРПН);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРПН);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийРасторжение);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервЕВ);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийРазделениеСНИЛС);
	ИначеЕсли ТекОбъект.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты Тогда
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийСВ);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийВозвратМСКРСВ);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРСВ);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ);
	ИначеЕсли ТекОбъект.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.Выплатной Тогда
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНП);
	КонецЕсли;	
	Запрос.УстановитьПараметр("ТипРезерва", СписокТиповРезерва);

	ОснЧасть = Новый СписокЗначений;
	ОснЧасть.Добавить(Справочники.уп_ТипыСуммОПС.ВзносыФиз);
	ОснЧасть.Добавить(Справочники.уп_ТипыСуммОПС.ИДФиз);
	Запрос.УстановитьПараметр("ОснЧасть", ОснЧасть);

	МатКап = Новый СписокЗначений;
	МатКап.Добавить(Справочники.уп_ТипыСуммОПС.МатКапитал);
	МатКап.Добавить(Справочники.уп_ТипыСуммОПС.ИДМатКапитал);
	Запрос.УстановитьПараметр("МатКап", МатКап);

	Запрос.УстановитьПараметр("ЭтоРПН", ?(ТекОбъект.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений,ИСТИНА,ЛОЖЬ));
	#Вставка
	// +ХМНПФ 15.02.2018 ШадринАВ // ЗапросБазыНачислений() // №1358
	Запрос.УстановитьПараметр("ХМ_ТабИзбранных", ХМ_ПолучитьТабИзбранных(ТекОбъект,"УмершиеРПН","ХМ_ИД2018")); // ХМНПФ 01.02.2019 ШадринАВ // №2012
	// -ХМНПФ 15.02.2018 ШадринАВ // ЗапросБазыНачислений() // №1358
    #КонецВставки
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уп_СостоянияДоговораОПС.ДоговорОПС КАК ДоговорОПС,
	|	уп_СостоянияДоговораОПС.Период КАК Период,
	|	уп_СостоянияДоговораОПС.Состояние КАК Состояние
	|ПОМЕСТИТЬ ТаблицаДоговоров
	|ИЗ
	|	РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(
	|			&ДатаРасчета,
	|			ДоговорОПС МЕЖДУ &МеньшийДоговор И &БольшийДоговор
	|				И ДоговорОПС.Организация = &Организация) КАК уп_СостоянияДоговораОПС
	|ГДЕ
	|	уп_СостоянияДоговораОПС.Состояние В(&СписокСостояний)
	|	И НЕ(уп_СостоянияДоговораОПС.Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговоровОПС.Закрыт)
	|				И уп_СостоянияДоговораОПС.Период < &ДатаНач)
	#Вставка
	// +ХМНПФ 15.02.2018 ШадринАВ // ЗапросБазыНачислений() // №1358
	|	ИЛИ уп_СостоянияДоговораОПС.ДоговорОПС.Наименование В (&ХМ_ТабИзбранных)
	// -ХМНПФ 15.02.2018 ШадринАВ // ЗапросБазыНачислений() // №1358
	#КонецВставки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
	|	уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.Период КАК Период,
	|	уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.Состояние КАК СостояниеОснЧасти
	|ПОМЕСТИТЬ ТаблицаСостоянийОснЧасти
	|ИЗ
	|	РегистрСведений.уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС.СрезПоследних(
	|			&ДатаРасчета,
	|			ДоговорОПС МЕЖДУ &МеньшийДоговор И &БольшийДоговор
	|				И ДоговорОПС.Организация = &Организация) КАК уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
	|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.Период КАК Период,
	|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.Состояние КАК СостояниеДопЧасти
	|ПОМЕСТИТЬ ТаблицаСостоянийДопЧасти
	|ИЗ
	|	РегистрСведений.уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС.СрезПоследних(
	|			&ДатаРасчета,
	|			ДоговорОПС МЕЖДУ &МеньшийДоговор И &БольшийДоговор
	|				И ДоговорОПС.Организация = &Организация) КАК уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезервыОПСОстаткиИОбороты.ДоговорОПС КАК ДоговорОПС,
	|	РезервыОПСОстаткиИОбороты.ТипСуммы КАК ТипСуммы,
	|	РезервыОПСОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	РезервыОПСОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
	|	РезервыОПСОстаткиИОбороты.СуммаРасход КАК СуммаРасход,
	|	РезервыОПСОстаткиИОбороты.Период КАК Период,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РАЗНОСТЬДАТ(РезервыОПСОстаткиИОбороты.Период, &ДатаНач, ДЕНЬ) КАК ЧИСЛО(10, 0))) = 0
	|			ТОГДА (ВЫРАЗИТЬ(РАЗНОСТЬДАТ(РезервыОПСОстаткиИОбороты.Период, &ДатаКон, ДЕНЬ) КАК ЧИСЛО(10, 0))) + 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РублеДни,
	|	ВЫРАЗИТЬ(РАЗНОСТЬДАТ(РезервыОПСОстаткиИОбороты.Период, &ДатаКон, ДЕНЬ) КАК ЧИСЛО(10, 0)) КАК РублеДниОборот,
	|	РезервыОПСОстаткиИОбороты.ТипРезерва КАК ТипРезерва,
	|	ВЫБОР
	|		КОГДА РезервыОПСОстаткиИОбороты.ТипСуммы В (&ОснЧасть)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоОснЧасть,
	|	ВЫБОР
	|		КОГДА НЕ РезервыОПСОстаткиИОбороты.ТипСуммы В (&ОснЧасть)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоДопЧасть,
	|	ВЫБОР
	|		КОГДА РезервыОПСОстаткиИОбороты.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.МатКапитал)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоМатКап,
	|	ВЫБОР
	|		КОГДА РезервыОПСОстаткиИОбороты.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДМатКапитал)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоИдМатКапитал,
	|	РезервыОПСОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
	|ПОМЕСТИТЬ ДвиженияДенег
	|ИЗ
	|	РегистрНакопления.уп_РезервыОПС.ОстаткиИОбороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			День,
	|			ДвиженияИГраницыПериода,
	|			ДоговорОПС МЕЖДУ &МеньшийДоговор И &БольшийДоговор
	|				И ДоговорОПС В
	|					(ВЫБРАТЬ
	|						ТаблицаДоговоров.ДоговорОПС
	|					ИЗ
	|						ТаблицаДоговоров)
	|				И Организация = &Организация
	|				И ТипРезерва В (&ТипРезерва)) КАК РезервыОПСОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уп_РезервыОПСНераспределенныеПлатежиОстаткиИОбороты.ДоговорОПС,
	|	уп_РезервыОПСНераспределенныеПлатежиОстаткиИОбороты.ТипСуммы,
	|	уп_РезервыОПСНераспределенныеПлатежиОстаткиИОбороты.СуммаНачальныйОстаток,
	|	уп_РезервыОПСНераспределенныеПлатежиОстаткиИОбороты.СуммаПриход,
	|	уп_РезервыОПСНераспределенныеПлатежиОстаткиИОбороты.СуммаРасход,
	|	уп_РезервыОПСНераспределенныеПлатежиОстаткиИОбороты.Период,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РАЗНОСТЬДАТ(уп_РезервыОПСНераспределенныеПлатежиОстаткиИОбороты.Период, &ДатаНач, ДЕНЬ) КАК ЧИСЛО(10, 0))) = 0
	|			ТОГДА (ВЫРАЗИТЬ(РАЗНОСТЬДАТ(уп_РезервыОПСНераспределенныеПлатежиОстаткиИОбороты.Период, &ДатаКон, ДЕНЬ) КАК ЧИСЛО(10, 0))) + 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫРАЗИТЬ(РАЗНОСТЬДАТ(уп_РезервыОПСНераспределенныеПлатежиОстаткиИОбороты.Период, &ДатаКон, ДЕНЬ) КАК ЧИСЛО(10, 0)),
	|	уп_РезервыОПСНераспределенныеПлатежиОстаткиИОбороты.ТипРезерва,
	|	ВЫБОР
	|		КОГДА уп_РезервыОПСНераспределенныеПлатежиОстаткиИОбороты.ТипСуммы В (&ОснЧасть)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ уп_РезервыОПСНераспределенныеПлатежиОстаткиИОбороты.ТипСуммы В (&ОснЧасть)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА уп_РезервыОПСНераспределенныеПлатежиОстаткиИОбороты.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.МатКапитал)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА уп_РезервыОПСНераспределенныеПлатежиОстаткиИОбороты.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДМатКапитал)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	уп_РезервыОПСНераспределенныеПлатежиОстаткиИОбороты.СуммаКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.уп_РезервыОПСНераспределенныеПлатежи.ОстаткиИОбороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			День,
	|			ДвиженияИГраницыПериода,
	|			ДоговорОПС В
	|					(ВЫБРАТЬ
	|						ТаблицаДоговоров.ДоговорОПС
	|					ИЗ
	#Удаление 
	|						ТаблицаДоговоров)	
	#КонецУдаления
	#Вставка
	// +ХМНПФ 02.02.2023 МилевскийАЮ // ЗапросБазыНачислений() // №3533
	|						ТаблицаДоговоров
	|					ГДЕ 
	|						ВЫБОР
	|							КОГДА ГОД(&ДатаКон) = 2022
	|								ТОГДА НЕ ТаблицаДоговоров.ДоговорОПС.Код В (""1174-ПС-23550"", ""0606-ПС-00733"", ""1372-ПС-24301"", ""0913-ПС-00397"", ""1606-ПС-26547"", ""0802-ПС-01466"", ""0711-ПС-12295"", ""1305-ПС-15953"", ""1313-ПС-11982"", ""1606-ПС-26388"", ""1311-ПС-28776"", ""1311-ПС-29978"", ""1309-ПС-03294"", ""0905-ПС-09757"", ""1306-ПС-22810"", ""0725-ПС-00469"", ""1311-ПС-28070"", ""1306-ПС-20931"", ""1711-ПС-34678"", ""0711-ПС-13058"", ""1606-ПС-26545"", ""1306-ПС-21185"", ""1311-ПС-27394"", ""1311-ПС-27422"", ""1311-ПС-30126"", ""0611-ПС-00132"", ""1713-ПС-15818"", ""0713-ПС-04059"", ""0821-ПС-01711"", ""1406-ПС-24014"", ""0896-ПС-13784"", ""0711-ПС-15834"", ""0711-ПС-16875"", ""0972-ПС-05612"", ""1211-ПС-27240"", ""1096-ПС-36927"", ""0711-ПС-12789"", ""1311-ПС-29248"", ""0811-ПС-19775"", ""0711-ПС-04858"", ""0621-ПС-00119"", ""0706-ПС-06086"", ""0711-пс-00229"", ""0704-ПС-01183"", ""1311-ПС-28720"", ""0713-пс-02222"")
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ)
	// -ХМНПФ 02.02.2023 МилевскийАЮ // ЗапросБазыНачислений() // №3533
	#КонецВставки
	|				И Организация = &Организация
	|				И ТипРезерва В (&ТипРезерва)) КАК уп_РезервыОПСНераспределенныеПлатежиОстаткиИОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС КАК ДоговорОПС,
	|	СУММА(уп_ПрочиеНачисленияОПСОбороты.СуммаРасход) КАК СуммаПриход,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(уп_ПрочиеНачисленияОПСОбороты.Период, ДЕНЬ)) КАК ДатаВозврата,
	|	СУММА(ВЫБОР
	|			КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.МатКапитал)
	|				ТОГДА уп_ПрочиеНачисленияОПСОбороты.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК МК,
	|	СУММА(ВЫБОР
	|			КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДМатКапитал)
	|				ТОГДА уп_ПрочиеНачисленияОПСОбороты.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ИД_МК
	|ПОМЕСТИТЬ ТаблицаВозвратовМК
	|ИЗ
	|	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			Регистратор,
	|			ДоговорОПС В
	|					(ВЫБРАТЬ
	|						ТаблицаДоговоров.ДоговорОПС
	|					ИЗ
	|						ТаблицаДоговоров)
	|				И ТипВыплаты = ЗНАЧЕНИЕ(Перечисление.уп_ТипыВыплат.ВозвратМатеринскогоКапитала)) КАК уп_ПрочиеНачисленияОПСОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ПоступленияОПСОбороты.ДоговорОПС КАК ДоговорОПС,
	|	уп_ПоступленияОПСОбороты.Период КАК Период,
	|	уп_ПоступленияОПСОбороты.СуммаОборот КАК СуммаОборот
	|ПОМЕСТИТЬ ПоступленияМК
	|ИЗ
	|	РегистрНакопления.уп_ПоступленияОПС.Обороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			Регистратор,
	|			ДоговорОПС В
	|					(ВЫБРАТЬ
	|						ТаблицаДоговоров.ДоговорОПС
	|					ИЗ
	|						ТаблицаДоговоров)
	|				И ТипСуммы В (&МатКап)) КАК уп_ПоступленияОПСОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВозвратовМК.ДоговорОПС КАК ДоговорОПС,
	|	ТаблицаВозвратовМК.ДатаВозврата КАК ДатаВозврата,
	|	ВЫБОР
	|		КОГДА ТаблицаВозвратовМК.СуммаПриход > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК БылВозврат,
	|	СУММА(ЕСТЬNULL(ПоступленияМК.СуммаОборот, 0)) КАК ПоступленияМКПослеДатыВозврата,
	|	ТаблицаВозвратовМК.МК КАК МК,
	|	ТаблицаВозвратовМК.ИД_МК КАК ИД_МК
	|ПОМЕСТИТЬ ТаблицаВозвратовМКСПоступлениями
	|ИЗ
	|	ТаблицаВозвратовМК КАК ТаблицаВозвратовМК
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоступленияМК КАК ПоступленияМК
	|		ПО ТаблицаВозвратовМК.ДоговорОПС = ПоступленияМК.ДоговорОПС
	|			И ТаблицаВозвратовМК.ДатаВозврата < ПоступленияМК.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаВозвратовМК.ДоговорОПС,
	|	ТаблицаВозвратовМК.ДатаВозврата,
	|	ВЫБОР
	|		КОГДА ТаблицаВозвратовМК.СуммаПриход > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ТаблицаВозвратовМК.МК,
	|	ТаблицаВозвратовМК.ИД_МК
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВозвратовМКСПоступлениями.ДоговорОПС КАК ДоговорОПС,
	|	ТаблицаВозвратовМКСПоступлениями.ДатаВозврата КАК ДатаВозврата,
	|	ТаблицаВозвратовМКСПоступлениями.БылВозврат КАК БылВозврат,
	|	ВЫБОР
	|		КОГДА ТаблицаВозвратовМКСПоступлениями.ПоступленияМКПослеДатыВозврата > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК БылоПоступлениеПослеВозврата,
	|	ТаблицаВозвратовМКСПоступлениями.МК КАК МК,
	|	ТаблицаВозвратовМКСПоступлениями.ИД_МК КАК ИД_МК
	|ПОМЕСТИТЬ ИтоговаяТабМК
	|ИЗ
	|	ТаблицаВозвратовМКСПоступлениями КАК ТаблицаВозвратовМКСПоступлениями
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
	|	уп_СостоянияДоговораОПССрезПоследних.Состояние КАК Состояние,
	|	уп_СостоянияДоговораОПССрезПоследних.Период КАК Период
	|ПОМЕСТИТЬ СостояниеНаДатуРасчета
	|ИЗ
	|	РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(
	|			&ДатаРасчета,
	|			ДоговорОПС В
	|				(ВЫБРАТЬ
	|					ТаблицаДоговоров.ДоговорОПС
	|				ИЗ
	|					ТаблицаДоговоров)) КАК уп_СостоянияДоговораОПССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
	|	уп_СостоянияДоговораОПССрезПоследних.Состояние КАК Состояние,
	|	уп_СостоянияДоговораОПССрезПоследних.Период КАК Период
	|ПОМЕСТИТЬ СостояниеНаНачалоПериода
	|ИЗ
	|	РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(
	|			&НачГодаПериодаНачисления,
	|			ДоговорОПС В
	|				(ВЫБРАТЬ
	|					ТаблицаДоговоров.ДоговорОПС
	|				ИЗ
	|					ТаблицаДоговоров)) КАК уп_СостоянияДоговораОПССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
	|	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия КАК ПричинаЗакрытия
	|ПОМЕСТИТЬ ПричиныЗакрытия
	|ИЗ
	|	РегистрСведений.уп_ПричиныЗакрытияДоговоровОПС.СрезПоследних(
	|			&ДатаРасчета,
	|			ДоговорОПС В
	|				(ВЫБРАТЬ
	|					ТаблицаДоговоров.ДоговорОПС
	|				ИЗ
	|					ТаблицаДоговоров)) КАК уп_ПричиныЗакрытияДоговоровОПССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ДатыКорректировокПенсийСрезПоследних.ДоговорОПС КАК ДоговорОПС,
	|	уп_ДатыКорректировокПенсийСрезПоследних.Период КАК ДатаПКорректировки
	|ПОМЕСТИТЬ ДатыКорректировок
	|ИЗ
	|	РегистрСведений.уп_ДатыКорректировокПенсий.СрезПоследних(
	|			&ДатаКон,
	|			ДоговорОПС В
	|					(ВЫБРАТЬ
	|						ТаблицаДоговоров.ДоговорОПС
	|					ИЗ
	|						ТаблицаДоговоров)
	|				И ТипПенсии = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсийОПС.Пожизненная)) КАК уп_ДатыКорректировокПенсийСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ДатыКорректировокПенсийСрезПоследних.ДоговорОПС КАК ДоговорОПС,
	|	уп_ДатыКорректировокПенсийСрезПоследних.Период КАК ДатаСКорректировки
	|ПОМЕСТИТЬ ДатыКорректировокСВ
	|ИЗ
	|	РегистрСведений.уп_ДатыКорректировокПенсий.СрезПоследних(
	|			&ДатаКон,
	|			ДоговорОПС В
	|					(ВЫБРАТЬ
	|						ТаблицаДоговоров.ДоговорОПС
	|					ИЗ
	|						ТаблицаДоговоров)
	|				И ТипПенсии = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсийОПС.Срочная)) КАК уп_ДатыКорректировокПенсийСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ДоговорОПС КАК ДоговорОПС,
	|	уп_ЗаявлениеЗЛОЕдиновременнойВыплате.Дата КАК Дата,
	|	уп_ЗаявлениеЗЛОЕдиновременнойВыплате.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТаблицаЗаявленийЕВ
	|ИЗ
	|	Документ.уп_ЗаявлениеЗЛОЕдиновременнойВыплате КАК уп_ЗаявлениеЗЛОЕдиновременнойВыплате
	|ГДЕ
	|	уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ДоговорОПС В
	|			(ВЫБРАТЬ
	|				ТаблицаДоговоров.ДоговорОПС
	|			ИЗ
	|				ТаблицаДоговоров)
	|	И уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ПринятоеРешение ССЫЛКА Документ.уп_РешениеОЕдиновременнойВыплате
	|	И уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ОтказаноВВыплате = ЛОЖЬ
	|	И уп_ЗаявлениеЗЛОЕдиновременнойВыплате.Проведен = ИСТИНА 
	#Вставка		
	// +ХМНПФ 22.07.2021 ШадринАВ // ЗапросБазыНачислений() // №3274
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	ЗаявлениеНП.ДоговорОПС КАК ДоговорОПС,
	|	ЗаявлениеНП.Дата КАК Дата,
	|	ЗаявлениеНП.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.уп_ЗаявлениеЗЛОНазначенииНЧТП КАК ЗаявлениеНП
	|ГДЕ
	|	ЗаявлениеНП.ДоговорОПС В
	|			(ВЫБРАТЬ
	|				ТаблицаДоговоров.ДоговорОПС
	|			ИЗ
	|				ТаблицаДоговоров)
	|	И ЗаявлениеНП.ПринятоеРешение ССЫЛКА Документ.уп_РешениеОЕдиновременнойВыплате
	|	И ЗаявлениеНП.ОтказаноВВыплате = ЛОЖЬ
	|	И ЗаявлениеНП.Проведен = ИСТИНА
	// -ХМНПФ 22.07.2021 ШадринАВ // ЗапросБазыНачислений() // №3274
	#КонецВставки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС,
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаявленийЕВ.ДоговорОПС КАК ДоговорОПС,
	|	МАКСИМУМ(ТаблицаЗаявленийЕВ.Дата) КАК Дата
	|ПОМЕСТИТЬ ТаблицаЗаявленийЕВМаксДата
	|ИЗ
	|	ТаблицаЗаявленийЕВ КАК ТаблицаЗаявленийЕВ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗаявленийЕВ.ДоговорОПС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС,
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаявленийЕВ.ДоговорОПС КАК ДоговорОПС,
	|	ТаблицаЗаявленийЕВ.Дата КАК Дата,
	|	ТаблицаЗаявленийЕВ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ПоследниеЗаявленияЕВ
	|ИЗ
	|	ТаблицаЗаявленийЕВ КАК ТаблицаЗаявленийЕВ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаЗаявленийЕВМаксДата КАК ТаблицаЗаявленийЕВМаксДата
	|		ПО ТаблицаЗаявленийЕВ.ДоговорОПС = ТаблицаЗаявленийЕВМаксДата.ДоговорОПС
	|			И ТаблицаЗаявленийЕВ.Дата = ТаблицаЗаявленийЕВМаксДата.Дата
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уп_РешениеОЕдиновременнойВыплате.ДоговорОПС КАК ДоговорОПС,
	|	ИСТИНА КАК ЕстьДопВыплатаЕВ
	|ПОМЕСТИТЬ РешегияОДопЕВ
	|ИЗ
	|	Документ.уп_РешениеОЕдиновременнойВыплате КАК уп_РешениеОЕдиновременнойВыплате
	|ГДЕ
	|	уп_РешениеОЕдиновременнойВыплате.ДополнительнаяВыплата = ИСТИНА
	|	И уп_РешениеОЕдиновременнойВыплате.Проведен = ИСТИНА
	|	И уп_РешениеОЕдиновременнойВыплате.ДокументОснование В
	|			(ВЫБРАТЬ
	|				ПоследниеЗаявленияЕВ.Ссылка
	|			ИЗ
	|				ПоследниеЗаявленияЕВ)
	|	И уп_РешениеОЕдиновременнойВыплате.Дата <= &ДатаКон
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_РезервыОПСОстатки.ДоговорОПС КАК ДоговорОПС,
	|	СУММА(уп_РезервыОПСОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА уп_РезервыОПСОстатки.ТипСуммы В (&ОснЧасть)
	|				ТОГДА уп_РезервыОПСОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОстатокОснЧасть,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ уп_РезервыОПСОстатки.ТипСуммы В (&ОснЧасть)
	|				ТОГДА уп_РезервыОПСОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОстатокДопЧасть,
	|	СУММА(ВЫБОР
	|			КОГДА уп_РезервыОПСОстатки.ТипСуммы В (&МатКап)
	|				ТОГДА уп_РезервыОПСОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОстатокМК
	|ПОМЕСТИТЬ ОстаткиНаКонПериода
	|ИЗ
	|	РегистрНакопления.уп_РезервыОПС.Остатки(
	|			&ДатаКон,
	|			ДоговорОПС В
	|					(ВЫБРАТЬ
	|						ТаблицаДоговоров.ДоговорОПС
	|					ИЗ
	|						ТаблицаДоговоров)
	|				И Организация = &Организация
	|				И ТипРезерва В (&ТипРезерва)) КАК уп_РезервыОПСОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_РезервыОПСОстатки.ДоговорОПС
	|;
	#Вставка 
	// +ХМНПФ 26.07.2021 ШадринАВ // ЗапросБазыНачислений() // №3268		
	|ВЫБРАТЬ
	|	АналитикаРОПС.ДоговорОПС КАК ДоговорОПС,
	|	СУММА(АналитикаРОПС.СуммаПриход) КАК СуммаПриход
	|ПОМЕСТИТЬ ХМ_ДоговораВРОПС
	|ИЗ
	|	РегистрНакопления.уп_АналитикаРезерваОПС.Обороты(
	|			,
	|			&ДатаКон,
	|			День,
	|			ДоговорОПС МЕЖДУ &МеньшийДоговор И &БольшийДоговор
	|				И ДоговорОПС В
	|					(ВЫБРАТЬ
	|						ТаблицаДоговоров.ДоговорОПС
	|					ИЗ
	|						ТаблицаДоговоров)
	|				И НЕ(ГОД(&ДатаКон) = 2019
	|						И ДоговорОПС.Наименование В (""1706-ПС-26796"", ""0896-ПС-02524"", ""1313-ПС-11184"", ""0972-ПС-08813"", ""1274-ПС-25917"", ""1113-ПС-07459"", ""0706-ПС-02390"", ""0821-ПС-01600"", ""1196-ПС-53422"", ""1472-ПС-33237"", ""0811-ПС-18255"", ""1796-ПС-74222""))) КАК АналитикаРОПС
	|СГРУППИРОВАТЬ ПО
	|	АналитикаРОПС.ДоговорОПС
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	// -ХМНПФ 26.07.2021 ШадринАВ // ЗапросБазыНачислений() // №3268
	|;
	#КонецВставки
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияДенег.ДоговорОПС КАК ДоговорОПС,
	|	ДвиженияДенег.ТипСуммы КАК ТипСуммы,
	|	ВЫБОР
	|		КОГДА ДвиженияДенег.ЭтоМатКап
	|				И ЕСТЬNULL(ИтоговаяТабМК.БылВозврат, ЛОЖЬ)
	|				И НЕ ЕСТЬNULL(ИтоговаяТабМК.БылоПоступлениеПослеВозврата, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ДвиженияДенег.Период > ИтоговаяТабМК.ДатаВозврата
	|						ТОГДА ДвиженияДенег.СуммаНачальныйОстаток
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ДвиженияДенег.СуммаНачальныйОстаток <= ИтоговаяТабМК.МК
	|								ТОГДА 0
	|							ИНАЧЕ ДвиженияДенег.СуммаНачальныйОстаток - ИтоговаяТабМК.МК
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОГДА ДвиженияДенег.ЭтоИдМатКапитал
	|				И ЕСТЬNULL(ИтоговаяТабМК.БылВозврат, ЛОЖЬ)
	|				И НЕ ЕСТЬNULL(ИтоговаяТабМК.БылоПоступлениеПослеВозврата, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ДвиженияДенег.Период > ИтоговаяТабМК.ДатаВозврата
	|						ТОГДА ДвиженияДенег.СуммаНачальныйОстаток
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ДвиженияДенег.СуммаНачальныйОстаток <= ИтоговаяТабМК.ИД_МК
	|								ТОГДА 0
	|							ИНАЧЕ ДвиженияДенег.СуммаНачальныйОстаток - ИтоговаяТабМК.ИД_МК
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ДвиженияДенег.СуммаНачальныйОстаток
	|	КОНЕЦ КАК СуммаНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА ДвиженияДенег.ЭтоМатКап
	|				И ЕСТЬNULL(ИтоговаяТабМК.БылВозврат, ЛОЖЬ)
	|				И НЕ ЕСТЬNULL(ИтоговаяТабМК.БылоПоступлениеПослеВозврата, ЛОЖЬ)
	|				И ДвиженияДенег.СуммаПриход <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА ДвиженияДенег.Период > ИтоговаяТабМК.ДатаВозврата
	|						ТОГДА ДвиженияДенег.СуммаПриход
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ДвиженияДенег.СуммаКонечныйОстаток <= ИтоговаяТабМК.МК
	|								ТОГДА 0
	|							КОГДА ДвиженияДенег.СуммаКонечныйОстаток - ИтоговаяТабМК.МК < ДвиженияДенег.СуммаПриход
	|								ТОГДА ДвиженияДенег.СуммаКонечныйОстаток - ИтоговаяТабМК.МК
	|							ИНАЧЕ ДвиженияДенег.СуммаПриход
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОГДА ДвиженияДенег.ЭтоИдМатКапитал
	|				И ЕСТЬNULL(ИтоговаяТабМК.БылВозврат, ЛОЖЬ)
	|				И НЕ ЕСТЬNULL(ИтоговаяТабМК.БылоПоступлениеПослеВозврата, ЛОЖЬ)
	|				И ДвиженияДенег.СуммаПриход <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА ДвиженияДенег.Период > ИтоговаяТабМК.ДатаВозврата
	|						ТОГДА ДвиженияДенег.СуммаПриход
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ДвиженияДенег.СуммаКонечныйОстаток <= ИтоговаяТабМК.ИД_МК
	|								ТОГДА 0
	|							КОГДА ДвиженияДенег.СуммаКонечныйОстаток - ИтоговаяТабМК.ИД_МК < ДвиженияДенег.СуммаПриход
	|								ТОГДА ДвиженияДенег.СуммаКонечныйОстаток - ИтоговаяТабМК.ИД_МК
	|							ИНАЧЕ ДвиженияДенег.СуммаПриход
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ДвиженияДенег.СуммаПриход
	|	КОНЕЦ КАК СуммаПриход,
	|	ВЫБОР
	|		КОГДА ДвиженияДенег.ЭтоМатКап
	|				И ЕСТЬNULL(ИтоговаяТабМК.БылВозврат, ЛОЖЬ)
	|				И НЕ ЕСТЬNULL(ИтоговаяТабМК.БылоПоступлениеПослеВозврата, ЛОЖЬ)
	|				И ДвиженияДенег.СуммаРасход <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА ДвиженияДенег.Период > ИтоговаяТабМК.ДатаВозврата
	|						ТОГДА ДвиженияДенег.СуммаРасход
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОГДА ДвиженияДенег.ЭтоИдМатКапитал
	|				И ЕСТЬNULL(ИтоговаяТабМК.БылВозврат, ЛОЖЬ)
	|				И НЕ ЕСТЬNULL(ИтоговаяТабМК.БылоПоступлениеПослеВозврата, ЛОЖЬ)
	|				И ДвиженияДенег.СуммаРасход <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА ДвиженияДенег.Период > ИтоговаяТабМК.ДатаВозврата
	|						ТОГДА ДвиженияДенег.СуммаРасход
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ДвиженияДенег.СуммаРасход
	|	КОНЕЦ КАК СуммаРасход,
	|	ДвиженияДенег.Период КАК Период,
	|	ВЫБОР
	#Вставка		
	// +ХМНПФ 15.02.2018 ШадринАВ // ЗапросБазыНачислений() // №1358
	|		КОГДА ДвиженияДенег.ДоговорОПС.Наименование В (&ХМ_ТабИзбранных) ТОГДА ЛОЖЬ ИНАЧЕ ВЫБОР
	// -ХМНПФ 15.02.2018 ШадринАВ // ЗапросБазыНачислений() // №1358	
	#КонецВставки
	|		КОГДА ДвиженияДенег.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервЕВ)
	|				И ЕСТЬNULL(РешегияОДопЕВ.ЕстьДопВыплатаЕВ, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		КОГДА СостояниеНаДатуРасчета.Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговоровОПС.Закрыт)
	|				И ПричиныЗакрытия.ПричинаЗакрытия <> ЗНАЧЕНИЕ(Перечисление.уп_ПричиныЗакрытияДоговораОПС.Досрочное)
	|				И ПричиныЗакрытия.ПричинаЗакрытия <> ЗНАЧЕНИЕ(Перечисление.уп_ПричиныЗакрытияДоговораОПС.ПереходДосрочный)
	|				И ПричиныЗакрытия.ПричинаЗакрытия <> ЗНАЧЕНИЕ(Перечисление.уп_ПричиныЗакрытияДоговораОПС.НеВступилВСилу)
	|				И ПричиныЗакрытия.ПричинаЗакрытия <> ЗНАЧЕНИЕ(Перечисление.уп_ПричиныЗакрытияДоговораОПС.ПоРешениюСуда)
	|               И ПричиныЗакрытия.ПричинаЗакрытия <> ЗНАЧЕНИЕ(Перечисление.уп_ПричиныЗакрытияДоговораОПС.ОбъединениеСНИЛС)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СостояниеНаДатуРасчета.Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговоровОПС.Закрыт)
	|						И СостояниеНаНачалоПериода.Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговоровОПС.Закрыт)
	|					ТОГДА ИСТИНА
	|				КОГДА СостояниеНаДатуРасчета.Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговоровОПС.Закрыт)
	|						И ПричиныЗакрытия.ПричинаЗакрытия = ЗНАЧЕНИЕ(Перечисление.уп_ПричиныЗакрытияДоговораОПС.ПереходДосрочный)
	|						И НЕ &НачислятьИДДосрочныйПереход
	|					ТОГДА ИСТИНА
	|				КОГДА СостояниеНаДатуРасчета.Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговоровОПС.Закрыт)
	|						И ПричиныЗакрытия.ПричинаЗакрытия = ЗНАЧЕНИЕ(Перечисление.уп_ПричиныЗакрытияДоговораОПС.Досрочное)
	|						И НЕ &НачислятьИДПереход
	|					ТОГДА ИСТИНА
	|				КОГДА СостояниеНаДатуРасчета.Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговоровОПС.Закрыт)
	|						И ПричиныЗакрытия.ПричинаЗакрытия = ЗНАЧЕНИЕ(Перечисление.уп_ПричиныЗакрытияДоговораОПС.НеВступилВСилу)
	|						И НЕ &НачислятьИДПоНевступившимСилу
	|					ТОГДА ИСТИНА
	|				КОГДА СостояниеНаДатуРасчета.Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговоровОПС.Закрыт)
	|						И ПричиныЗакрытия.ПричинаЗакрытия = ЗНАЧЕНИЕ(Перечисление.уп_ПричиныЗакрытияДоговораОПС.ПоРешениюСуда)
	|						И НЕ &НачислятьИДПоРешениюСуда
	|					ТОГДА ИСТИНА
	|				КОГДА СостояниеНаДатуРасчета.Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговоровОПС.ОбязательстваВыполнены)
	|						И &ПорядокРасчетаИДОбязательстваВыполнены = 0
	|					ТОГДА ИСТИНА
	|				КОГДА СостояниеНаДатуРасчета.Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговоровОПС.ОбязательстваВыполнены)
	|						И &ПорядокРасчетаИДОбязательстваВыполнены = 1
	|						И ЕСТЬNULL(ОстаткиНаКонПериода.СуммаОстаток, 0) = 0
	|					ТОГДА ИСТИНА
	|				КОГДА СостояниеНаДатуРасчета.Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговоровОПС.ВыплатнойПериод)
	|						И &ЭтоРПН
	|						И ТаблицаСостоянийОснЧасти.СостояниеОснЧасти = ЗНАЧЕНИЕ(Перечисление.уп_СостояниеЧастиПенсионногоСчетаОПС.НЧТП)
	|						И ДвиженияДенег.ЭтоОснЧасть
	|						И ДатыКорректировок.ДатаПКорректировки ЕСТЬ НЕ NULL 
	|						И ДатыКорректировок.ДатаПКорректировки >= &ДатаНач
	|						И ДатыКорректировок.ДатаПКорректировки <= &ДатаКон
	|						И ЕСТЬNULL(ОстаткиНаКонПериода.СуммаОстатокОснЧасть, 0) = 0
	|					ТОГДА ИСТИНА
	|				КОГДА СостояниеНаДатуРасчета.Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговоровОПС.ВыплатнойПериод)
	|						И &ЭтоРПН
	|						И ТаблицаСостоянийДопЧасти.СостояниеДопЧасти = ЗНАЧЕНИЕ(Перечисление.уп_СостояниеЧастиПенсионногоСчетаОПС.НЧТП)
	|						И ДвиженияДенег.ЭтоДопЧасть
	|						И ДатыКорректировок.ДатаПКорректировки ЕСТЬ НЕ NULL 
	|						И ДатыКорректировок.ДатаПКорректировки >= &ДатаНач
	|						И ДатыКорректировок.ДатаПКорректировки <= &ДатаКон
	|						И ЕСТЬNULL(ОстаткиНаКонПериода.СуммаОстатокДопЧасть, 0) = 0
	|					ТОГДА ИСТИНА
	|				КОГДА СостояниеНаДатуРасчета.Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговоровОПС.ВыплатнойПериод)
	|						И &ЭтоРПН
	|						И ТаблицаСостоянийДопЧасти.СостояниеДопЧасти = ЗНАЧЕНИЕ(Перечисление.уп_СостояниеЧастиПенсионногоСчетаОПС.СрочнаяВыплата)
	|						И ДвиженияДенег.ЭтоДопЧасть
	|						И ДатыКорректировокСВ.ДатаСКорректировки ЕСТЬ НЕ NULL 
	|						И ДатыКорректировокСВ.ДатаСКорректировки >= &ДатаНач
	|						И ДатыКорректировокСВ.ДатаСКорректировки <= &ДатаКон
	|						И ЕСТЬNULL(ОстаткиНаКонПериода.СуммаОстатокДопЧасть, 0) = 0
	|					ТОГДА ИСТИНА
	|				КОГДА СостояниеНаДатуРасчета.Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговоровОПС.ВыплатнойПериод)
	|						И &ЭтоРПН
	|						И ТаблицаСостоянийОснЧасти.СостояниеОснЧасти = ЗНАЧЕНИЕ(Перечисление.уп_СостояниеЧастиПенсионногоСчетаОПС.ОбязательстваВыполнены)
	|						И ДвиженияДенег.ЭтоОснЧасть
	|						И ЕСТЬNULL(ОстаткиНаКонПериода.СуммаОстатокОснЧасть, 0) = 0
	|					ТОГДА ИСТИНА
	|				КОГДА СостояниеНаДатуРасчета.Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговоровОПС.ВыплатнойПериод)
	|						И &ЭтоРПН
	|						И ТаблицаСостоянийДопЧасти.СостояниеДопЧасти = ЗНАЧЕНИЕ(Перечисление.уп_СостояниеЧастиПенсионногоСчетаОПС.ОбязательстваВыполнены)
	|						И ДвиженияДенег.ЭтоДопЧасть
	|						И ЕСТЬNULL(ОстаткиНаКонПериода.СуммаОстатокДопЧасть, 0) = 0
	|					ТОГДА ИСТИНА
	|				КОГДА СостояниеНаДатуРасчета.Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию)
	|						И ПричиныЗакрытия.ПричинаЗакрытия = ЗНАЧЕНИЕ(Перечисление.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти)
	|						И ЕСТЬNULL(РешегияОДопЕВ.ЕстьДопВыплатаЕВ, ЛОЖЬ)
	|						И ЕСТЬNULL(ОстаткиНаКонПериода.СуммаОстаток, 0) = 0
	|					ТОГДА ИСТИНА
	#Вставка
	// +ХМНПФ 26.07.2021 ШадринАВ // ЗапросБазыНачислений() // №3268
	|				КОГДА СостояниеНаДатуРасчета.Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию)
	|						И ПричиныЗакрытия.ПричинаЗакрытия = ЗНАЧЕНИЕ(Перечисление.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти)
	|						И ЕСТЬNULL(ХМ_ДоговораВРОПС.СуммаПриход, 0) <> 0
	|					ТОГДА ИСТИНА
	// -ХМНПФ 26.07.2021 ШадринАВ // ЗапросБазыНачислений() // №3268
	#КонецВставки
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	#Вставка
	// +ХМНПФ 15.02.2018 ШадринАВ // ЗапросБазыНачислений() // №1358
	|		КОНЕЦ
	// -ХМНПФ 15.02.2018 ШадринАВ // ЗапросБазыНачислений() // №1358	
	#КонецВставки
	|	КОНЕЦ КАК НеНужно,
	|	СостояниеНаДатуРасчета.Состояние КАК Состояние,
	|	СостояниеНаНачалоПериода.Период КАК ДатаСостояния,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(РАЗНОСТЬДАТ(ДвиженияДенег.Период, &ДатаНач, ДЕНЬ) КАК ЧИСЛО(10, 0))) = 0
	|			ТОГДА (ВЫРАЗИТЬ(РАЗНОСТЬДАТ(ДвиженияДенег.Период, &ДатаКон, ДЕНЬ) КАК ЧИСЛО(10, 0))) + 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РублеДни,
	|	ВЫРАЗИТЬ(РАЗНОСТЬДАТ(ДвиженияДенег.Период, &ДатаКон, ДЕНЬ) КАК ЧИСЛО(10, 0)) КАК РублеДниОборот,
	|	ДатыКорректировок.ДатаПКорректировки КАК ДатаПКорректировки,
	|	ДвиженияДенег.ТипРезерва КАК ТипРезерва,
	|	ТаблицаСостоянийДопЧасти.СостояниеДопЧасти КАК СостояниеДопЧасти,
	|	ТаблицаСостоянийОснЧасти.СостояниеОснЧасти КАК СостояниеОснЧасти,
	|	ДвиженияДенег.ЭтоОснЧасть КАК ЭтоОснЧасть,
	|	ДвиженияДенег.ЭтоДопЧасть КАК ЭтоДопЧасть,
	|	ДвиженияДенег.ЭтоМатКап КАК ЭтоМатКап,
	|	ДвиженияДенег.ЭтоИдМатКапитал КАК ЭтоИдМатКапитал,
	|	ДвиженияДенег.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ИтоговаяТабМК.ДатаВозврата КАК ДатаВозвратаМК,
	|	ИтоговаяТабМК.БылВозврат КАК БылВозврат,
	|	ИтоговаяТабМК.МК КАК МК,
	|	ИтоговаяТабМК.ИД_МК КАК ИД_МК,
	|	ИтоговаяТабМК.БылоПоступлениеПослеВозврата КАК БылоПоступлениеПослеВозврата,
	|	ДвиженияДенег.СуммаПриход КАК СуммаПриход1,
	|	ДвиженияДенег.СуммаРасход КАК СуммаРасход1,
	|	ДвиженияДенег.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток1
	#Удаление 
	|ПОМЕСТИТЬ ВыбВсе	
	#КонецУдаления
	#Вставка 
	// +ХМНПФ 22.07.2021 ШадринАВ // ЗапросБазыНачислений() // №3274
	|ПОМЕСТИТЬ ХМ_ВыбВсе
	// -ХМНПФ 22.07.2021 ШадринАВ // ЗапросБазыНачислений() // №3274
	#КонецВставки
	|ИЗ
	|	ДвиженияДенег КАК ДвиженияДенег
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПричиныЗакрытия КАК ПричиныЗакрытия
	|		ПО ДвиженияДенег.ДоговорОПС = ПричиныЗакрытия.ДоговорОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеНаДатуРасчета КАК СостояниеНаДатуРасчета
	|		ПО ДвиженияДенег.ДоговорОПС = СостояниеНаДатуРасчета.ДоговорОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеНаНачалоПериода КАК СостояниеНаНачалоПериода
	|		ПО ДвиженияДенег.ДоговорОПС = СостояниеНаНачалоПериода.ДоговорОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиНаКонПериода КАК ОстаткиНаКонПериода
	|		ПО ДвиженияДенег.ДоговорОПС = ОстаткиНаКонПериода.ДоговорОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыКорректировок КАК ДатыКорректировок
	|		ПО ДвиженияДенег.ДоговорОПС = ДатыКорректировок.ДоговорОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РешегияОДопЕВ КАК РешегияОДопЕВ
	|		ПО ДвиженияДенег.ДоговорОПС = РешегияОДопЕВ.ДоговорОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСостоянийОснЧасти КАК ТаблицаСостоянийОснЧасти
	|		ПО ДвиженияДенег.ДоговорОПС = ТаблицаСостоянийОснЧасти.ДоговорОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСостоянийДопЧасти КАК ТаблицаСостоянийДопЧасти
	|		ПО ДвиженияДенег.ДоговорОПС = ТаблицаСостоянийДопЧасти.ДоговорОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыКорректировокСВ КАК ДатыКорректировокСВ
	|		ПО ДвиженияДенег.ДоговорОПС = ДатыКорректировокСВ.ДоговорОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтоговаяТабМК КАК ИтоговаяТабМК
	|		ПО ДвиженияДенег.ДоговорОПС = ИтоговаяТабМК.ДоговорОПС
	#Вставка 
	// +ХМНПФ 26.07.2021 ШадринАВ // ЗапросБазыНачислений() // №3268
	|		ЛЕВОЕ СОЕДИНЕНИЕ ХМ_ДоговораВРОПС КАК ХМ_ДоговораВРОПС
	|		ПО ДвиженияДенег.ДоговорОПС = ХМ_ДоговораВРОПС.ДоговорОПС
	// -ХМНПФ 26.07.2021 ШадринАВ // ЗапросБазыНачислений() // №3268
	#КонецВставки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	#Вставка 
	// +ХМНПФ 22.07.2021 ШадринАВ // ЗапросБазыНачислений() // №3274
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РезервыОПСОстаткиИОбороты.ДоговорОПС КАК ДоговорОПС,
	|	РезервыОПСОстаткиИОбороты.Регистратор КАК РешениеЕДВДОП,
	|	РезервыОПСОстаткиИОбороты.Период КАК ДатаРешенияЕДВДОП,
	|	НЕ ВЫРАЗИТЬ(РезервыОПСОстаткиИОбороты.Регистратор КАК Документ.уп_РешениеОЕдиновременнойВыплате).НеУчитыватьДопВзносы КАК УчитыватьДопВзносы,
	|	ВыплатыОПС.Период КАК ДатаВыплатыЕДВДОП,
	|	ВыплатыОПС.Регистратор КАК ВыплатнойРеестрЕДВДОП
	|ПОМЕСТИТЬ ХМ_РешенияИВыплатныеРеестрыЕДВДОП
	|ИЗ
	|	РегистрНакопления.уп_РезервыОПС.ОстаткиИОбороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			Регистратор,
	|			ДвиженияИГраницыПериода,
	|			ДоговорОПС МЕЖДУ &МеньшийДоговор И &БольшийДоговор
	|				И ДоговорОПС В
	|					(ВЫБРАТЬ
	|						ТаблицаДоговоров.ДоговорОПС
	|					ИЗ
	|						ТаблицаДоговоров)
	|				И ТипРезерва В (&ТипРезерва)) КАК РезервыОПСОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.уп_ВыплатыОПС.Обороты(&ДатаНач, &ДатаКон, Регистратор, ) КАК ВыплатыОПС
	|		ПО РезервыОПСОстаткиИОбороты.Регистратор = ВыплатыОПС.Решение
	|			И РезервыОПСОстаткиИОбороты.ДоговорОПС = ВыплатыОПС.ДоговорОПС
	|ГДЕ
	|	РезервыОПСОстаткиИОбороты.Регистратор ССЫЛКА Документ.уп_РешениеОЕдиновременнойВыплате
	|	И ВЫРАЗИТЬ(РезервыОПСОстаткиИОбороты.Регистратор КАК Документ.уп_РешениеОЕдиновременнойВыплате).ДополнительнаяВыплата
	|	И &ЭтоРПН И ГОД(&ДатаКон)=2020
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// движения решений о доп. выплате ЕДВ
	|ВЫБРАТЬ
	|	РезервыОПСОстаткиИОбороты.ДоговорОПС КАК ДоговорОПС,
	|	РезервыОПСОстаткиИОбороты.ТипСуммы КАК ТипСуммы,
	|	РезервыОПСОстаткиИОбороты.ТипРезерва КАК ТипРезерва,
	|	НАЧАЛОПЕРИОДА(РезервыОПСОстаткиИОбороты.Период, ДЕНЬ) КАК Период,
	|	РезервыОПСОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	РезервыОПСОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
	|	РезервыОПСОстаткиИОбороты.СуммаРасход КАК СуммаРасход,
	|	РезервыОПСОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ИСТИНА КАК ХМ_НеНужно
	|ПОМЕСТИТЬ ХМ_ДвиженияЕДВдоп
	|ИЗ
	|	РегистрНакопления.уп_РезервыОПС.ОстаткиИОбороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			Регистратор,
	|			ДвиженияИГраницыПериода,
	|			ДоговорОПС МЕЖДУ &МеньшийДоговор И &БольшийДоговор
	|				И ДоговорОПС В
	|					(ВЫБРАТЬ
	|						ТаблицаДоговоров.ДоговорОПС
	|					ИЗ
	|						ТаблицаДоговоров)
	|				И ТипРезерва В (&ТипРезерва)) КАК РезервыОПСОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ХМ_РешенияИВыплатныеРеестрыЕДВДОП КАК ХМ_РешенияИВыплатныеРеестрыЕДВДОП
	|		ПО РезервыОПСОстаткиИОбороты.ДоговорОПС = ХМ_РешенияИВыплатныеРеестрыЕДВДОП.ДоговорОПС
	|			И РезервыОПСОстаткиИОбороты.Регистратор = ХМ_РешенияИВыплатныеРеестрыЕДВДОП.РешениеЕДВДОП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	// + движения по выплатным реестрам с доп. выплатой ЕДВ
	|ВЫБРАТЬ
	|	РезервыОПСОстаткиИОбороты.ДоговорОПС,
	|	РезервыОПСОстаткиИОбороты.ТипСуммы,
	|	РезервыОПСОстаткиИОбороты.ТипРезерва,
	|	НАЧАЛОПЕРИОДА(РезервыОПСОстаткиИОбороты.Период, ДЕНЬ),
	|	РезервыОПСОстаткиИОбороты.СуммаНачальныйОстаток,
	|	РезервыОПСОстаткиИОбороты.СуммаПриход,
	|	РезервыОПСОстаткиИОбороты.СуммаРасход,
	|	РезервыОПСОстаткиИОбороты.СуммаКонечныйОстаток,
	|	ИСТИНА
	|ИЗ
	|	РегистрНакопления.уп_РезервыОПС.ОстаткиИОбороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			Регистратор,
	|			ДвиженияИГраницыПериода,
	|			ДоговорОПС МЕЖДУ &МеньшийДоговор И &БольшийДоговор
	|				И ДоговорОПС В
	|					(ВЫБРАТЬ
	|						ТаблицаДоговоров.ДоговорОПС
	|					ИЗ
	|						ТаблицаДоговоров)
	|				И ТипРезерва В (&ТипРезерва)) КАК РезервыОПСОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ХМ_РешенияИВыплатныеРеестрыЕДВДОП КАК ХМ_РешенияИВыплатныеРеестрыЕДВДОП
	|		ПО РезервыОПСОстаткиИОбороты.ДоговорОПС = ХМ_РешенияИВыплатныеРеестрыЕДВДОП.ДоговорОПС
	|			И РезервыОПСОстаткиИОбороты.Регистратор = ХМ_РешенияИВыплатныеРеестрыЕДВДОП.ВыплатнойРеестрЕДВДОП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	// + остатки начальные по типам сумм ушедшим на доп. выплату ЕДВ
	|ВЫБРАТЬ
	|	РезервыОПСОстаткиИОбороты.ДоговорОПС,
	|	РезервыОПСОстаткиИОбороты.ТипСуммы,
	|	РезервыОПСОстаткиИОбороты.ТипРезерва,
	|	НАЧАЛОПЕРИОДА(&ДатаНач, ДЕНЬ),
	|	РезервыОПСОстаткиИОбороты.СуммаНачальныйОстаток,
	|	РезервыОПСОстаткиИОбороты.СуммаПриход,
	|	РезервыОПСОстаткиИОбороты.СуммаРасход,
	|	РезервыОПСОстаткиИОбороты.СуммаКонечныйОстаток,
	|	ИСТИНА
	|ИЗ
	|	РегистрНакопления.уп_РезервыОПС.ОстаткиИОбороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			Регистратор,
	|			ДвиженияИГраницыПериода,
	|			ДоговорОПС МЕЖДУ &МеньшийДоговор И &БольшийДоговор
	|				И ДоговорОПС В
	|					(ВЫБРАТЬ
	|						ТаблицаДоговоров.ДоговорОПС
	|					ИЗ
	|						ТаблицаДоговоров)
	|				И ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)) КАК РезервыОПСОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ХМ_РешенияИВыплатныеРеестрыЕДВДОП КАК ХМ_РешенияИВыплатныеРеестрыЕДВДОП
	|		ПО РезервыОПСОстаткиИОбороты.ДоговорОПС = ХМ_РешенияИВыплатныеРеестрыЕДВДОП.ДоговорОПС
	|			И РезервыОПСОстаткиИОбороты.Регистратор = ХМ_РешенияИВыплатныеРеестрыЕДВДОП.РешениеЕДВДОП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	// + приход не вошедший в доп. выплату ЕДВ
	|ВЫБРАТЬ
	|	РезервыОПСОстаткиИОбороты.ДоговорОПС,
	|	РезервыОПСОстаткиИОбороты.ТипСуммы,
	|	РезервыОПСОстаткиИОбороты.ТипРезерва,
	|	НАЧАЛОПЕРИОДА(ХМ_ВыбВсе.Период, ДЕНЬ),
	|	ХМ_ВыбВсе.СуммаНачальныйОстаток,
	|	ХМ_ВыбВсе.СуммаПриход,
	|	ХМ_ВыбВсе.СуммаРасход,
	|	ХМ_ВыбВсе.СуммаКонечныйОстаток,
	|	ИСТИНА
	|ИЗ
	|	РегистрНакопления.уп_РезервыОПС.ОстаткиИОбороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			Регистратор,
	|			ДвиженияИГраницыПериода,
	|			ДоговорОПС МЕЖДУ &МеньшийДоговор И &БольшийДоговор
	|				И ДоговорОПС В
	|					(ВЫБРАТЬ
	|						ТаблицаДоговоров.ДоговорОПС
	|					ИЗ
	|						ТаблицаДоговоров)
	|				И ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)) КАК РезервыОПСОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ХМ_РешенияИВыплатныеРеестрыЕДВДОП КАК ХМ_РешенияИВыплатныеРеестрыЕДВДОП
	|		ПО РезервыОПСОстаткиИОбороты.ДоговорОПС = ХМ_РешенияИВыплатныеРеестрыЕДВДОП.ДоговорОПС
	|			И РезервыОПСОстаткиИОбороты.Регистратор = ХМ_РешенияИВыплатныеРеестрыЕДВДОП.РешениеЕДВДОП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ХМ_ВыбВсе КАК ХМ_ВыбВсе
	|		ПО РезервыОПСОстаткиИОбороты.ДоговорОПС = ХМ_ВыбВсе.ДоговорОПС
	|			И РезервыОПСОстаткиИОбороты.ТипСуммы = ХМ_ВыбВсе.ТипСуммы
	|			И РезервыОПСОстаткиИОбороты.ТипРезерва = ХМ_ВыбВсе.ТипРезерва
	|			И РезервыОПСОстаткиИОбороты.СуммаКонечныйОстаток <> ХМ_ВыбВсе.СуммаПриход
	|			И (ХМ_ВыбВсе.СуммаПриход <> 0)
	|			И (ХМ_ВыбВсе.Период < РезервыОПСОстаткиИОбороты.Период)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС,
	|	ТипСуммы,
	|	ТипРезерва
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХМ_ВыбВсе.ДоговорОПС КАК ДоговорОПС,
	|	ХМ_ВыбВсе.ТипСуммы КАК ТипСуммы,
	|	ХМ_ВыбВсе.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ХМ_ВыбВсе.СуммаПриход КАК СуммаПриход,
	|	ХМ_ВыбВсе.СуммаРасход КАК СуммаРасход,
	|	ХМ_ВыбВсе.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ХМ_ВыбВсе.Период КАК Период,
	|	ЕСТЬNULL(ХМ_ДвиженияЕДВдоп.ХМ_НеНужно, ХМ_ВыбВсе.НеНужно) КАК НеНужно,
	|	ХМ_ВыбВсе.Состояние КАК Состояние,
	|	ХМ_ВыбВсе.ДатаСостояния КАК ДатаСостояния,
	|	ХМ_ВыбВсе.РублеДни КАК РублеДни,
	|	ХМ_ВыбВсе.РублеДниОборот КАК РублеДниОборот,
	|	ХМ_ВыбВсе.ДатаПКорректировки КАК ДатаПКорректировки,
	|	ХМ_ВыбВсе.ТипРезерва КАК ТипРезерва,
	|	ХМ_ВыбВсе.СостояниеДопЧасти КАК СостояниеДопЧасти,
	|	ХМ_ВыбВсе.СостояниеОснЧасти КАК СостояниеОснЧасти,
	|	ХМ_ВыбВсе.ЭтоОснЧасть КАК ЭтоОснЧасть,
	|	ХМ_ВыбВсе.ЭтоДопЧасть КАК ЭтоДопЧасть,
	|	ХМ_ВыбВсе.ЭтоМатКап КАК ЭтоМатКап,
	|	ХМ_ВыбВсе.ЭтоИдМатКапитал КАК ЭтоИдМатКапитал,
	|	ХМ_ВыбВсе.ДатаВозвратаМК КАК ДатаВозвратаМК,
	|	ХМ_ВыбВсе.БылВозврат КАК БылВозврат,
	|	ХМ_ВыбВсе.МК КАК МК,
	|	ХМ_ВыбВсе.ИД_МК КАК ИД_МК,
	|	ХМ_ВыбВсе.БылоПоступлениеПослеВозврата КАК БылоПоступлениеПослеВозврата,
	|	ХМ_ВыбВсе.СуммаПриход1 КАК СуммаПриход1,
	|	ХМ_ВыбВсе.СуммаРасход1 КАК СуммаРасход1,
	|	ХМ_ВыбВсе.СуммаНачальныйОстаток1 КАК СуммаНачальныйОстаток1
	|ПОМЕСТИТЬ ВыбВсе
	|ИЗ
	|	ХМ_ВыбВсе КАК ХМ_ВыбВсе
	|		ЛЕВОЕ СОЕДИНЕНИЕ ХМ_ДвиженияЕДВдоп КАК ХМ_ДвиженияЕДВдоп
	|		ПО ХМ_ВыбВсе.ДоговорОПС = ХМ_ДвиженияЕДВдоп.ДоговорОПС
	|			И ХМ_ВыбВсе.ТипРезерва = ХМ_ДвиженияЕДВдоп.ТипРезерва
	|			И ХМ_ВыбВсе.ТипСуммы = ХМ_ДвиженияЕДВдоп.ТипСуммы
	|			И ХМ_ВыбВсе.Период = ХМ_ДвиженияЕДВдоп.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	// -ХМНПФ 22.07.2021 ШадринАВ // ЗапросБазыНачислений() // №3274
	#КонецВставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыбВсе.ДоговорОПС КАК ДоговорОПС,
	|	ВыбВсе.ДоговорОПС.Участник КАК Участник,
	|	ВыбВсе.ТипСуммы КАК ТипСуммы,
	|	ВыбВсе.Состояние КАК Состояние,
	|	СУММА(ВыбВсе.СуммаНачальныйОстаток * ВыбВсе.РублеДни + ВыбВсе.СуммаПриход * ВыбВсе.РублеДниОборот - ВыбВсе.СуммаРасход * ВыбВсе.РублеДниОборот) КАК РублеДни
	|ПОМЕСТИТЬ ТабРезультат
	|ИЗ
	|	ВыбВсе КАК ВыбВсе
	|ГДЕ
	|	НЕ ВыбВсе.ДоговорОПС.Участник = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяССЫЛКА)
	|	И НЕ ВыбВсе.НеНужно
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыбВсе.ДоговорОПС,
	|	ВыбВсе.ДоговорОПС.Участник,
	|	ВыбВсе.ТипСуммы,
	|	ВыбВсе.Состояние
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДоговоров.ДоговорОПС КАК ДоговорОПС,
	|	ТабРезультат.ДоговорОПС КАК ДоговорОПСсРезервом,
	|	ТаблицаДоговоров.Состояние КАК Состояние,
	|	ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ВзносыФиз) КАК ТипСуммы,
	|	0 КАК РублеДни,
	|	ТаблицаДоговоров.ДоговорОПС.Участник КАК Участник
	|ПОМЕСТИТЬ НакопительныеВсе
	|ИЗ
	|	ТаблицаДоговоров КАК ТаблицаДоговоров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабРезультат КАК ТабРезультат
	|		ПО ТаблицаДоговоров.ДоговорОПС = ТабРезультат.ДоговорОПС
	|ГДЕ
	|	ТаблицаДоговоров.Состояние = &НакопительныйПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НакопительныеВсе.ДоговорОПС КАК ДоговорОПС,
	|	НакопительныеВсе.Состояние КАК Состояние,
	|	НакопительныеВсе.ТипСуммы КАК ТипСуммы,
	|	НакопительныеВсе.РублеДни КАК РублеДни,
	|	НакопительныеВсе.Участник КАК Участник
	|ПОМЕСТИТЬ НакопительныеПустые
	|ИЗ
	|	НакопительныеВсе КАК НакопительныеВсе
	|ГДЕ
	|	НакопительныеВсе.ДоговорОПСсРезервом ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабРезультат.ДоговорОПС КАК ДоговорОПС,
	|	ТабРезультат.Участник КАК Участник,
	|	ТабРезультат.ДоговорОПС.Родитель КАК ГруппаДоговора,
	|	ТабРезультат.ТипСуммы КАК ТипСуммы,
	|	ТабРезультат.Состояние КАК Состояние,
	|	ТабРезультат.РублеДни КАК РублеДни,
	|	ТабРезультат.ДоговорОПС.ПодразделениеБУ КАК ПодразделениеБУ
	|ИЗ
	|	ТабРезультат КАК ТабРезультат
	|ГДЕ
	|	ТабРезультат.РублеДни <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НакопительныеПустые.ДоговорОПС,
	|	НакопительныеПустые.Участник,
	|	НакопительныеПустые.ДоговорОПС.Родитель,
	|	НакопительныеПустые.ТипСуммы,
	|	НакопительныеПустые.Состояние,
	|	НакопительныеПустые.РублеДни,
	|	НакопительныеПустые.ДоговорОПС.ПодразделениеБУ
	|ИЗ
	|	НакопительныеПустые КАК НакопительныеПустые
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеБУ,
	|	ГруппаДоговора,
	|	ДоговорОПС,
	|	ТипСуммы";	

	Возврат Запрос

КонецФункции
